corvus-wsclient/src/test/resources/hk.hku.cecid.corvus.ws.EBMSMessageHistoryQuerySender/testResponse.log

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><messageList xmlns="http://service.ebms.edi.cecid.hku.hk/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns0="http://www.w3.org/2001/XMLSchema-instance" ns0:type="MessageList"><messageElement ns0:type="MessageElement"><messageId ns0:type="xsd:string">20080402-105745-64017@147.8.177.37</messageId><messageBox ns0:type="xsd:string">inbox</messageBox></messageElement></messageList></SOAP-ENV:Body></SOAP-ENV:Envelope>